rattrayalex/RebbleOS/hw/drivers/nrf52_bluetooth/nrf52_bluetooth_hid.c
/* nrf52_bluetooth_hid.c
 * BLE HID-over-GATT (HOGP) keyboard host on an nRF52 SoftDevice central link
 * RebbleOS
 *
 * The phone talks to the watch over a peripheral link (nrf52_bluetooth.c,
 * nrf52_bluetooth_ppogatt.c).  This file owns the one central link that
 * the SoftDevice is configured for (NRF_SDH_BLE_CENTRAL_LINK_COUNT 1) and
 * uses it to find a Bluetooth LE keyboard, bond with it, subscribe to its
 * input reports and hand those reports to rcore/keyboard.c.
 *
 * Context rules.  NRF_SDH_DISPATCH_MODEL is INTERRUPT, so _hid_handler()
 * runs in the SoftDevice event interrupt.  It may call sd_* functions and
 * update this file's static state, but it must not block and must not
 * call into rcore.  Everything that blocks (prefs_get, prefs_put) or calls
 * the core (keyboard_hid_boot_report, keyboard_link_state_changed) is
 * deferred to the service thread with service_submit().  The hw_keyboard_*
 * entry points run on app threads; they call sd_* functions directly (the
 * SoftDevice API is an SVC interface and may be used from any thread) and
 * protect the shared state with taskENTER_CRITICAL(), which masks the
 * SoftDevice event interrupt (service_submit() from that interrupt already
 * relies on it running at a FreeRTOS-maskable priority).  No sd_* call is
 * ever made inside a critical section: an SVC issued with BASEPRI raised
 * faults.
 *
 * State machine (see enum hid_state): idle -> scanning -> connecting ->
 * pairing -> discovering -> subscribing -> ready, with any link event able
 * to drop back to idle.  A background reconnect is "connecting" without a
 * preceding scan.  Every transition logs "HID: state a -> b".
 */

#include <debug.h>
#include "rebbleos.h"
#include "service.h"
#include "prefs.h"
#include "keyboard.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "ble_gap.h"
#include "ble_gattc.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_srv_common.h"
#include "app_util.h"
#include "nrf52_bluetooth_internal.h"

int sfmt(char *buf, unsigned int len, const char *ifmt, ...);

#define HID_LOG(lvl_, fmt_, ...) DRV_LOG("bt", lvl_, "HID: " fmt_, ##__VA_ARGS__)
#define HID_ARRAY_SIZE(a_) (sizeof(a_) / sizeof((a_)[0]))

/***** Tunables *****/

/* Pairing scan: active, 100 ms interval, 50 ms window, 30 s timeout. */
#define HID_SCAN_INTERVAL       MSEC_TO_UNITS(100, UNIT_0_625_MS)
#define HID_SCAN_WINDOW         MSEC_TO_UNITS(50, UNIT_0_625_MS)
#define HID_SCAN_TIMEOUT        3000  /* 10 ms units: 30 s */
#define HID_CONNECT_TIMEOUT     1000  /* 10 ms units: 10 s for the connect after a scan hit */

/* Background reconnect: 2 s interval, 22.5 ms window (36 x 0.625 ms), no
 * timeout, so the initiator sits in the SoftDevice until the keyboard
 * advertises again. */
#define HID_RECONNECT_INTERVAL  MSEC_TO_UNITS(2000, UNIT_0_625_MS)
#define HID_RECONNECT_WINDOW    36

/* Connection parameters requested from the keyboard. */
#define HID_CONN_INTERVAL_MIN   MSEC_TO_UNITS(15, UNIT_1_25_MS)
#define HID_CONN_INTERVAL_MAX   MSEC_TO_UNITS(30, UNIT_1_25_MS)
#define HID_CONN_SUP_TIMEOUT    MSEC_TO_UNITS(4000, UNIT_10_MS)

#define HID_RETRY_MS            50     /* retry a busy SoftDevice call after this */
#define HID_WATCHDOG_MS         15000  /* a link that is not ready by then is dropped */
#define HID_FAIL_BACKOFF_MS     5000   /* delay before reconnecting after a failure */

#define HID_MAX_INPUTS          5      /* one Boot Keyboard Input Report plus up to 4 Report characteristics */
#define HID_MAX_REPORT_CHARS    4
#define HID_REPORT_MAX          16     /* bytes kept per input report */
#define HID_RING_SLOTS          8

#define HID_REPORT_TYPE_INPUT   1      /* Report Reference descriptor, report type field */
#define HID_PROTOCOL_MODE_BOOT  0x00

/* Appearance values 0x03C0..0x03FF are the HID category; 960 is generic HID
 * and 961 is keyboard.  Everything else in the category (mouse 962, ...) is
 * not a keyboard. */
#define HID_APPEARANCE_CATEGORY_MASK 0xFFC0
#define HID_APPEARANCE_CATEGORY      0x03C0

/***** Link state *****/

enum hid_state {
    HID_IDLE = 0,
    HID_SCANNING,
    HID_CONNECTING,
    HID_PAIRING,
    HID_DISCOVERING,
    HID_SUBSCRIBING,
    HID_READY,
};

static const char *_state_names[] = {
    "idle", "scanning", "connecting", "pairing", "discovering", "subscribing", "ready"
};

static enum hid_state _hid_state = HID_IDLE;
static uint16_t _hid_conn = BLE_CONN_HANDLE_INVALID;
static uint32_t _hid_link_gen = 0;       /* bumps on every connection; tags deferred work */
static ble_gap_addr_t _hid_peer_addr;    /* address the current link was made with */
static char _hid_name[KEYBOARD_NAME_MAX] = "";

static uint8_t _hid_connect_is_pairing = 0;   /* the pending / current connection came from a pairing scan */
static uint8_t _hid_pairing_requested = 0;    /* sd_ble_gap_authenticate() was called on this link */
static uint8_t _hid_encrypt_fallback_used = 0;/* a rejected stored key already fell back to pairing */
static uint8_t _hid_encrypted = 0;            /* BLE_GAP_EVT_CONN_SEC_UPDATE reported level >= 2 */
static uint8_t _hid_auth_done = 0;            /* BLE_GAP_EVT_AUTH_STATUS success arrived */
static uint8_t _hid_pair_after_disconnect = 0;/* hw_keyboard_pair_start() while connected: scan when the link drops */
static uint8_t _hid_forgetting = 0;           /* hw_keyboard_forget() is dropping the link: do not reconnect */
static uint8_t _hid_reconnect_backoff = 0;    /* the last link failed: delay the next background reconnect */
static uint32_t _hid_hvx_logged = 0;          /* HVX events logged at INFO so far */

/***** Bond record *****/

/* Persisted under PREFS_KEY_KEYBOARD_BOND.  Natural (not packed) layout on
 * purpose: the SoftDevice is handed pointers into this record
 * (sd_ble_gap_encrypt, sd_ble_gap_device_identities_set), the master_id
 * inside ble_gap_enc_key_t needs 2-byte alignment, and GCC's
 * -Waddress-of-packed-member would flag every such pointer.  The record is
 * only ever read back by the firmware that wrote it; a size mismatch on
 * load is treated as "no bond". */
struct hid_bond {
    uint8_t valid;
    ble_gap_addr_t addr;         /* address the keyboard connected with (may be a resolvable private address) */
    ble_gap_enc_key_t peer_enc;  /* keyboard's LTK + master id: what sd_ble_gap_encrypt() needs from the central */
    ble_gap_id_key_t peer_id;    /* keyboard's IRK + identity address, for private addresses */
    ble_gap_enc_key_t own_enc;   /* our LTK; unused by a central but kept with the bond */
    char name[KEYBOARD_NAME_MAX];
};

static struct hid_bond _bond;    /* working copy; written by the event handler, snapshotted by threads under a critical section */
static uint8_t _bond_loaded = 0;

/* Key storage the SoftDevice fills during pairing (sd_ble_gap_sec_params_reply). */
static ble_gap_enc_key_t _keys_own_enc, _keys_peer_enc;
static ble_gap_id_key_t _keys_own_id, _keys_peer_id;

