rattrayalex/RebbleOS/hw/drivers/nrf52_bluetooth/nrf52_bluetooth_hid.c
/* S140: in the central role the keyset given to sd_ble_gap_sec_params_reply
 * must provide memory for the peer's keys; the own-key pointers may be NULL
 * but we want our LTK for the record too. */
static const ble_gap_sec_keyset_t _hid_keyset = {
    .keys_own = {
        .p_enc_key = &_keys_own_enc,
        .p_id_key = &_keys_own_id,
        .p_sign_key = NULL,
        .p_pk = NULL,
    },
    .keys_peer = {
        .p_enc_key = &_keys_peer_enc,
        .p_id_key = &_keys_peer_id,
        .p_sign_key = NULL,
        .p_pk = NULL,
    },
};

/* Just Works bonding: no I/O, no MITM, legacy pairing, LTK + IRK both ways. */
static const ble_gap_sec_params_t _hid_sec_params = {
    .bond = 1,
    .mitm = 0,
    .lesc = 0,
    .keypress = 0,
    .io_caps = BLE_GAP_IO_CAPS_NONE,
    .oob = 0,
    .min_key_size = 7,
    .max_key_size = 16,
    .kdist_own = { .enc = 1, .id = 1 },
    .kdist_peer = { .enc = 1, .id = 1 },
};

/***** Scanning and connecting *****/

/* S140: the scan buffer must stay alive until the scanner stops; a legacy
 * (non-extended) scan needs at least BLE_GAP_SCAN_BUFFER_MIN bytes. */
static uint8_t _scan_buf_data[BLE_GAP_SCAN_BUFFER_MIN];
static const ble_data_t _scan_buf = { .p_data = _scan_buf_data, .len = sizeof(_scan_buf_data) };

static const ble_gap_scan_params_t _scan_params_pair = {
    .extended = 0,
    .report_incomplete_evts = 0,
    .active = 1,
    .filter_policy = BLE_GAP_SCAN_FP_ACCEPT_ALL,
    .scan_phys = BLE_GAP_PHY_1MBPS,
    .interval = HID_SCAN_INTERVAL,
    .window = HID_SCAN_WINDOW,
    .timeout = HID_SCAN_TIMEOUT,
};

/* Initiator parameters after a scan hit ("active" is ignored by sd_ble_gap_connect). */
static const ble_gap_scan_params_t _scan_params_connect = {
    .extended = 0,
    .report_incomplete_evts = 0,
    .active = 0,
    .filter_policy = BLE_GAP_SCAN_FP_ACCEPT_ALL,
    .scan_phys = BLE_GAP_PHY_1MBPS,
    .interval = HID_SCAN_INTERVAL,
    .window = HID_SCAN_WINDOW,
    .timeout = HID_CONNECT_TIMEOUT,
};

/* Low duty initiator for the background reconnect. */
static const ble_gap_scan_params_t _scan_params_reconnect = {
    .extended = 0,
    .report_incomplete_evts = 0,
    .active = 0,
    .filter_policy = BLE_GAP_SCAN_FP_ACCEPT_ALL,
    .scan_phys = BLE_GAP_PHY_1MBPS,
    .interval = HID_RECONNECT_INTERVAL,
    .window = HID_RECONNECT_WINDOW,
    .timeout = BLE_GAP_SCAN_TIMEOUT_UNLIMITED,
};

static const ble_gap_conn_params_t _conn_params = {
    .min_conn_interval = HID_CONN_INTERVAL_MIN,
    .max_conn_interval = HID_CONN_INTERVAL_MAX,
    .slave_latency = 0,
    .conn_sup_timeout = HID_CONN_SUP_TIMEOUT,
};

/* Candidate found by the pairing scan; we wait one more report for its name. */
static ble_gap_addr_t _cand_addr;
static uint8_t _cand_valid = 0;
static uint8_t _cand_reports = 0;
static uint32_t _scan_reports_seen = 0;

/* Device identity list entry for a keyboard with a resolvable private address. */
static ble_gap_id_key_t const *_id_list[1];

/***** GATT discovery *****/

enum hid_input_kind {
    INPUT_BOOT_KEYBOARD,   /* 0x2A22 */
    INPUT_REPORT,          /* 0x2A4D */
};

struct hid_input {
    uint8_t kind;
    uint8_t notify;
    uint8_t report_id;
    uint8_t report_type;   /* from the Report Reference descriptor; 0 when unknown */
    uint8_t subscribed;
    uint16_t decl;         /* characteristic declaration handle */
    uint16_t value;        /* characteristic value handle */
    uint16_t desc_end;     /* last handle that may hold this characteristic's descriptors; 0 until known */
    uint16_t cccd;         /* BLE_GATT_HANDLE_INVALID when not found */
    uint16_t ref;          /* Report Reference descriptor, BLE_GATT_HANDLE_INVALID when not found */
};

enum hid_disc_phase {
    DISC_NONE = 0,
    DISC_SERVICE,     /* sd_ble_gattc_primary_services_discover(0x1812) */
    DISC_CHARS,       /* sd_ble_gattc_characteristics_discover over the service */
    DISC_DESCS,       /* sd_ble_gattc_descriptors_discover per input characteristic */
    DISC_REFS,        /* sd_ble_gattc_read of each Report Reference descriptor */
    DISC_PROTO,       /* write Protocol Mode = boot (write command) */
    DISC_PROTO_WAIT,  /* waiting for BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE */
    DISC_CCCD,        /* write CCCD = notification (write request) per chosen input */
    DISC_DONE,
};

static enum hid_disc_phase _disc_phase = DISC_NONE;
static ble_gattc_handle_range_t _svc_range;
static uint16_t _proto_mode_hnd = BLE_GATT_HANDLE_INVALID;
static struct hid_input _inputs[HID_MAX_INPUTS];
static uint8_t _n_inputs = 0;
static uint8_t _n_report_chars = 0;
static struct hid_input *_last_input = NULL;  /* last characteristic seen was this input: its desc_end is still open */
static uint16_t _char_next = 0;               /* start handle for the next characteristic discovery call */
static uint16_t _desc_next = 0;               /* start handle for the next descriptor discovery call, 0 = not started */
static uint8_t _disc_idx = 0;                 /* index into _inputs for DESCS / REFS / CCCD */
static uint8_t _use_boot = 0;

/***** Input report ring (event context -> service thread) *****/

struct hid_slot {
    uint8_t len;
    uint8_t data[HID_REPORT_MAX];
};

static struct hid_slot _ring[HID_RING_SLOTS];
static volatile uint8_t _ring_head = 0;   /* next slot to write */
static volatile uint8_t _ring_tail = 0;   /* next slot to read */
static volatile uint8_t _ring_count = 0;
static volatile uint8_t _ring_drain_pending = 0;
static uint32_t _ring_dropped = 0;

/***** Deferred retry of a busy SoftDevice call *****/

enum hid_retry {
    RETRY_NONE = 0,
    RETRY_ENCRYPT,
    RETRY_AUTHENTICATE,
    RETRY_SEC_PARAMS_REPLY,
    RETRY_DISCOVERY,
};

static uint8_t _retry_what = RETRY_NONE;

/***** Small helpers *****/

static const char *_addr_str(const ble_gap_addr_t *a) {
    static char buf[24];
    sfmt(buf, sizeof(buf), "%02x:%02x:%02x:%02x:%02x:%02x/%d",
         a->addr[5], a->addr[4], a->addr[3], a->addr[2], a->addr[1], a->addr[0], a->addr_type);
    return buf;
}

