rattrayalex/RebbleOS/hw/drivers/nrf52_bluetooth/nrf52_bluetooth_hid.c
static int _addr_eq(const ble_gap_addr_t *a, const ble_gap_addr_t *b) {
    return a->addr_type == b->addr_type && memcmp(a->addr, b->addr, BLE_GAP_ADDR_LEN) == 0;
}

static const char *_gap_evt_names[] = {
    "CONNECTED", "DISCONNECTED", "CONN_PARAM_UPDATE", "SEC_PARAMS_REQUEST",
    "SEC_INFO_REQUEST", "PASSKEY_DISPLAY", "KEY_PRESSED", "AUTH_KEY_REQUEST",
    "LESC_DHKEY_REQUEST", "AUTH_STATUS", "CONN_SEC_UPDATE", "TIMEOUT",
    "RSSI_CHANGED", "ADV_REPORT", "SEC_REQUEST", "CONN_PARAM_UPDATE_REQUEST",
    "SCAN_REQ_REPORT", "PHY_UPDATE_REQUEST", "PHY_UPDATE",
    "DATA_LENGTH_UPDATE_REQUEST", "DATA_LENGTH_UPDATE",
    "QOS_CHANNEL_SURVEY_REPORT", "ADV_SET_TERMINATED",
};

static const char *_gattc_evt_names[] = {
    "PRIM_SRVC_DISC_RSP", "REL_DISC_RSP", "CHAR_DISC_RSP", "DESC_DISC_RSP",
    "ATTR_INFO_DISC_RSP", "CHAR_VAL_BY_UUID_READ_RSP", "READ_RSP",
    "CHAR_VALS_READ_RSP", "WRITE_RSP", "HVX", "EXCHANGE_MTU_RSP", "TIMEOUT",
    "WRITE_CMD_TX_COMPLETE",
};

static const char *_evt_name(uint16_t id) {
    if (id >= BLE_GAP_EVT_BASE && id < BLE_GAP_EVT_BASE + HID_ARRAY_SIZE(_gap_evt_names))
        return _gap_evt_names[id - BLE_GAP_EVT_BASE];
    if (id >= BLE_GATTC_EVT_BASE && id < BLE_GATTC_EVT_BASE + HID_ARRAY_SIZE(_gattc_evt_names))
        return _gattc_evt_names[id - BLE_GATTC_EVT_BASE];
    if (id >= BLE_GATTS_EVT_BASE && id <= BLE_GATTS_EVT_LAST)
        return "GATTS";
    return "?";
}

static void _set_state(enum hid_state st) {
    if (st == _hid_state)
        return;
    HID_LOG(APP_LOG_LEVEL_INFO, "state %s -> %s", _state_names[_hid_state], _state_names[st]);
    _hid_state = st;
}

/* Thread context: keyboard_link_state_changed() may only be called from a
 * thread, so every state report goes through the service thread. */
static void _svc_link_state(void *ctx) {
    KeyboardLinkState st = (KeyboardLinkState)(intptr_t)ctx;
    keyboard_link_state_changed(st, _hid_name[0] ? _hid_name : NULL);
}

static void _report_link_state(KeyboardLinkState st) {
    service_submit(_svc_link_state, (void *)(intptr_t)st, 0);
}

/* True when the bond carries a usable identity: an identity address type and
 * a non-zero IRK.  A keyboard that did not distribute an IRK leaves zeros. */
static int _bond_id_usable(void) {
    const ble_gap_id_key_t *id = &_bond.peer_id;
    if (id->id_addr_info.addr_type != BLE_GAP_ADDR_TYPE_PUBLIC &&
        id->id_addr_info.addr_type != BLE_GAP_ADDR_TYPE_RANDOM_STATIC)
        return 0;
    for (int i = 0; i < BLE_GAP_SEC_KEY_LEN; i++)
        if (id->id_info.irk[i])
            return 1;
    return 0;
}

static int _peer_matches_bond(const ble_gap_addr_t *peer) {
    if (!_bond.valid)
        return 0;
    if (_addr_eq(peer, &_bond.addr))
        return 1;
    /* A resolved private address is reported as the identity address. */
    if (peer->addr_id_peer && _bond_id_usable() && _addr_eq(peer, &_bond.peer_id.id_addr_info))
        return 1;
    return 0;
}

/***** Deferred work on the service thread *****/

static void _disc_step(void);
static void _reconnect_start(void);
static void _fail(const char *why);
static void _svc_drain_ring(void *ctx);

static void _svc_retry(void *ctx) {
    uint32_t gen = (uint32_t)(intptr_t)ctx;
    uint8_t what;
    int alive;
    ret_code_t rv;

    taskENTER_CRITICAL();
    alive = (gen == _hid_link_gen && _hid_conn != BLE_CONN_HANDLE_INVALID);
    what = _retry_what;
    _retry_what = RETRY_NONE;
    taskEXIT_CRITICAL();
    if (!alive || what == RETRY_NONE)
        return;

    HID_LOG(APP_LOG_LEVEL_INFO, "retrying step %d", what);
    switch (what) {
    case RETRY_ENCRYPT:
        rv = sd_ble_gap_encrypt(_hid_conn, &_bond.peer_enc.master_id, &_bond.peer_enc.enc_info);
        if (rv != NRF_SUCCESS)
            _fail("sd_ble_gap_encrypt retry failed");
        break;
    case RETRY_AUTHENTICATE:
        rv = sd_ble_gap_authenticate(_hid_conn, &_hid_sec_params);
        if (rv != NRF_SUCCESS)
            _fail("sd_ble_gap_authenticate retry failed");
        break;
    case RETRY_SEC_PARAMS_REPLY:
        rv = sd_ble_gap_sec_params_reply(_hid_conn, BLE_GAP_SEC_STATUS_SUCCESS, NULL, &_hid_keyset);
        if (rv != NRF_SUCCESS)
            _fail("sd_ble_gap_sec_params_reply retry failed");
        break;
    case RETRY_DISCOVERY:
        _disc_step();
        break;
    }
}

/* Schedule a retry of a SoftDevice call that returned NRF_ERROR_BUSY (the
 * same trick nrf52_bluetooth.c uses for the remote-name read). */
static void _defer_retry(enum hid_retry what) {
    _retry_what = what;
    service_submit(_svc_retry, (void *)(intptr_t)_hid_link_gen, pdMS_TO_TICKS(HID_RETRY_MS));
}

/* Discovery watchdog: a link that is not ready HID_WATCHDOG_MS after it
 * connected is dropped, whatever step it is stuck in. */
static void _svc_watchdog(void *ctx) {
    uint32_t gen = (uint32_t)(intptr_t)ctx;
    int stuck;
    uint16_t conn;

    taskENTER_CRITICAL();
    conn = _hid_conn;
    stuck = (gen == _hid_link_gen && conn != BLE_CONN_HANDLE_INVALID && _hid_state != HID_READY);
    if (stuck)
        _hid_reconnect_backoff = 1;
    taskEXIT_CRITICAL();
    if (!stuck)
        return;
    HID_LOG(APP_LOG_LEVEL_ERROR, "watchdog: link not ready after %d ms (state %s, discovery phase %d); disconnecting",
            HID_WATCHDOG_MS, _state_names[_hid_state], _disc_phase);
    (void) sd_ble_gap_disconnect(conn, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
}

static void _svc_reconnect(void *ctx) {
    uint32_t gen = (uint32_t)(intptr_t)ctx;
    if (gen != _hid_link_gen)
        return;
    _reconnect_start();
}

/* Bond persistence.  prefs_get/prefs_put block on the flash filesystem, so
 * both only ever run here, on the service thread.  flash_init runs before
 * bluetooth_init (rcore/rebbleos.c) and rcore/tz.c already reads prefs
 * earlier in boot, so prefs is usable by the time the load callback runs. */
static void _svc_bond_load(void *ctx) {
    struct hid_bond b;
    int n = prefs_get(PREFS_KEY_KEYBOARD_BOND, &b, sizeof(b));

    if (n == (int)sizeof(b) && b.valid) {
        taskENTER_CRITICAL();
        memcpy(&_bond, &b, sizeof(_bond));
        _bond.name[sizeof(_bond.name) - 1] = 0;
        strncpy(_hid_name, _bond.name, sizeof(_hid_name) - 1);
        _bond_loaded = 1;
        taskEXIT_CRITICAL();
        HID_LOG(APP_LOG_LEVEL_INFO, "loaded bond for \"%s\" at %s (identity %s)", _bond.name,
                _addr_str(&_bond.addr), _bond_id_usable() ? "yes" : "no");
        _reconnect_start();
    } else {
        _bond_loaded = 1;
        HID_LOG(APP_LOG_LEVEL_INFO, "no stored keyboard bond (prefs_get returned %d)", n);
    }
}

static void _svc_bond_store(void *ctx) {
    struct hid_bond b;

