rattrayalex/RebbleOS/hw/drivers/nrf52_bluetooth/nrf52_bluetooth_hid.c
    taskENTER_CRITICAL();
    memcpy(&b, &_bond, sizeof(b));
    taskEXIT_CRITICAL();

    int rv = prefs_put(PREFS_KEY_KEYBOARD_BOND, &b, sizeof(b));
    if (rv < 0)
        HID_LOG(APP_LOG_LEVEL_ERROR, "prefs_put(keyboard bond) failed (%d)", rv);
    else
        HID_LOG(APP_LOG_LEVEL_INFO, "bond record %s", b.valid ? "stored" : "cleared");
}

/***** Input report ring *****/

/* Event context. */
static void _ring_push(const uint8_t *data, uint16_t len) {
    if (len > HID_REPORT_MAX)
        len = HID_REPORT_MAX;
    if (_ring_count == HID_RING_SLOTS) {
        _ring_tail = (_ring_tail + 1) % HID_RING_SLOTS;
        _ring_count--;
        _ring_dropped++;
        HID_LOG(APP_LOG_LEVEL_WARNING, "report ring full; dropped the oldest report (%d dropped so far)", _ring_dropped);
    }
    struct hid_slot *slot = &_ring[_ring_head];
    memcpy(slot->data, data, len);
    slot->len = len;
    _ring_head = (_ring_head + 1) % HID_RING_SLOTS;
    _ring_count++;
    if (!_ring_drain_pending) {
        _ring_drain_pending = 1;
        service_submit(_svc_drain_ring, NULL, 0);
    }
}

/* Service thread: deliver queued reports to the core in order. */
static void _svc_drain_ring(void *ctx) {
    struct hid_slot slot;

    for (;;) {
        taskENTER_CRITICAL();
        if (_ring_count == 0) {
            _ring_drain_pending = 0;
            taskEXIT_CRITICAL();
            return;
        }
        memcpy(&slot, &_ring[_ring_tail], sizeof(slot));
        _ring_tail = (_ring_tail + 1) % HID_RING_SLOTS;
        _ring_count--;
        taskEXIT_CRITICAL();
        keyboard_hid_boot_report(slot.data, slot.len);
    }
}

/***** Link teardown *****/

static void _link_reset(void) {
    _hid_conn = BLE_CONN_HANDLE_INVALID;
    _hid_pairing_requested = 0;
    _hid_encrypt_fallback_used = 0;
    _hid_encrypted = 0;
    _hid_auth_done = 0;
    _hid_connect_is_pairing = 0;
    _retry_what = RETRY_NONE;
    _disc_phase = DISC_NONE;
    _proto_mode_hnd = BLE_GATT_HANDLE_INVALID;
    _n_inputs = 0;
    _n_report_chars = 0;
    _last_input = NULL;
    _use_boot = 0;
}

/* Something on this link went wrong: log, drop the link, and let
 * BLE_GAP_EVT_DISCONNECTED do the bookkeeping.  Never asserts: the air is
 * not under our control. */
static void _fail(const char *why) {
    HID_LOG(APP_LOG_LEVEL_ERROR, "%s (state %s); disconnecting", why, _state_names[_hid_state]);
    _hid_reconnect_backoff = 1;
    if (_hid_conn != BLE_CONN_HANDLE_INVALID) {
        ret_code_t rv = sd_ble_gap_disconnect(_hid_conn, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        if (rv != NRF_SUCCESS)
            HID_LOG(APP_LOG_LEVEL_ERROR, "sd_ble_gap_disconnect failed (%d)", rv);
    }
}

/***** Scanning *****/

/* Start a fresh pairing scan.  Returns 0 on success. */
static int _scan_start(void) {
    ret_code_t rv = sd_ble_gap_scan_start(&_scan_params_pair, &_scan_buf);
    if (rv != NRF_SUCCESS) {
        HID_LOG(APP_LOG_LEVEL_ERROR, "sd_ble_gap_scan_start failed (%d)", rv);
        return -1;
    }
    _cand_valid = 0;
    _cand_reports = 0;
    _scan_reports_seen = 0;
    _hid_name[0] = 0;
    _set_state(HID_SCANNING);
    _report_link_state(KeyboardLinkScanning);
    return 0;
}

/* S140: after each BLE_GAP_EVT_ADV_REPORT (data status complete) the
 * scanner is paused, and the application must call
 * sd_ble_gap_scan_start(NULL, &buf) to continue. */
static void _scan_continue(void) {
    ret_code_t rv = sd_ble_gap_scan_start(NULL, &_scan_buf);
    if (rv == NRF_SUCCESS)
        return;
    /* NRF_ERROR_INVALID_STATE here means the scanner already timed out;
     * BLE_GAP_EVT_TIMEOUT follows and finishes the job. */
    if (rv != NRF_ERROR_INVALID_STATE) {
        HID_LOG(APP_LOG_LEVEL_ERROR, "sd_ble_gap_scan_start(continue) failed (%d)", rv);
        _set_state(HID_IDLE);
        _report_link_state(KeyboardLinkDisconnected);
    }
}

static int _adv_find_name(const uint8_t *data, uint16_t len, char *out, size_t outsz) {
    uint16_t offset = 0;
    uint16_t n = ble_advdata_search(data, len, &offset, BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME);
    if (n == 0) {
        offset = 0;
        n = ble_advdata_search(data, len, &offset, BLE_GAP_AD_TYPE_SHORT_LOCAL_NAME);
    }
    if (n == 0)
        return 0;
    if (n > outsz - 1)
        n = outsz - 1;
    memcpy(out, data + offset, n);
    out[n] = 0;
    return 1;
}

static int _adv_find_appearance(const uint8_t *data, uint16_t len, uint16_t *out) {
    uint16_t offset = 0;
    uint16_t n = ble_advdata_search(data, len, &offset, BLE_GAP_AD_TYPE_APPEARANCE);
    if (n < 2)
        return 0;
    *out = (uint16_t)data[offset] | ((uint16_t)data[offset + 1] << 8);
    return 1;
}

/* Issue sd_ble_gap_connect.  S140: this stops any running scanner, even
 * when the call fails. */
static ret_code_t _connect_to(const ble_gap_addr_t *addr, const ble_gap_scan_params_t *sp, int pairing) {
    ret_code_t rv = sd_ble_gap_connect(addr, sp, &_conn_params, CONN_TAG);
    if (rv != NRF_SUCCESS) {
        HID_LOG(APP_LOG_LEVEL_ERROR, "sd_ble_gap_connect(%s) failed (%d)", _addr_str(addr), rv);
        return rv;
    }
    HID_LOG(APP_LOG_LEVEL_INFO, "%s to %s", pairing ? "connecting" : "background reconnect pending", _addr_str(addr));
    _hid_connect_is_pairing = pairing;
    _set_state(HID_CONNECTING);
    if (pairing)
        _report_link_state(KeyboardLinkConnecting);
    return NRF_SUCCESS;
}

static void _on_adv_report(const ble_gap_evt_adv_report_t *r) {
    static const ble_uuid_t hid_uuid = { .uuid = BLE_UUID_HUMAN_INTERFACE_DEVICE_SERVICE, .type = BLE_UUID_TYPE_BLE };
    const uint8_t *data = r->data.p_data;
    uint16_t len = r->data.len;
    char name[KEYBOARD_NAME_MAX];
    int have_name;
    int is_cand = 0;

    if (_hid_state != HID_SCANNING)
        return;  /* a report that raced our connect / stop; the buffer is released, nothing to continue */

    _scan_reports_seen++;
    have_name = _adv_find_name(data, len, name, sizeof(name));

    if (_cand_valid && _addr_eq(&r->peer_addr, &_cand_addr)) {
        is_cand = 1;
    } else if (r->type.connectable || r->type.scan_response) {
        uint16_t appearance = 0;
        int have_app = _adv_find_appearance(data, len, &appearance);
        int has_hid_uuid = ble_advdata_uuid_find(data, len, &hid_uuid);
        int other_hid = have_app &&
                        (appearance & HID_APPEARANCE_CATEGORY_MASK) == HID_APPEARANCE_CATEGORY &&
                        appearance != BLE_APPEARANCE_HID_KEYBOARD &&
                        appearance != BLE_APPEARANCE_GENERIC_HID;
        if (other_hid) {
            HID_LOG(APP_LOG_LEVEL_INFO, "skipping %s: HID appearance %d is not a keyboard", _addr_str(&r->peer_addr), appearance);
        } else if (has_hid_uuid || (have_app && appearance == BLE_APPEARANCE_HID_KEYBOARD)) {
            is_cand = 1;
            _cand_addr = r->peer_addr;
            _cand_valid = 1;
            _cand_reports = 0;
            _hid_name[0] = 0;
            HID_LOG(APP_LOG_LEVEL_INFO, "candidate %s rssi %d (hid uuid %d, appearance %d, %s)",
                    _addr_str(&r->peer_addr), r->rssi, has_hid_uuid, have_app ? appearance : -1,
                    r->type.scan_response ? "scan rsp" : "adv");
        }
    }

    if (!is_cand) {
        _scan_continue();
        return;
    }

