rattrayalex/RebbleOS/hw/drivers/nrf52_bluetooth/nrf52_bluetooth_hid.c
    _cand_reports++;
    if (have_name) {
        strncpy(_hid_name, name, sizeof(_hid_name) - 1);
        _hid_name[sizeof(_hid_name) - 1] = 0;
        HID_LOG(APP_LOG_LEVEL_INFO, "candidate name \"%s\"", _hid_name);
    }

    /* Names usually travel in the scan response, which our active scan
     * requests; give the candidate one more report to deliver it unless it
     * is not scannable at all. */
    if (!have_name && r->type.scannable && _cand_reports < 2) {
        _scan_continue();
        return;
    }

    if (_connect_to(&_cand_addr, &_scan_params_connect, 1) != NRF_SUCCESS) {
        /* The scanner is stopped even on failure: start over, not continue. */
        _set_state(HID_IDLE);
        if (_scan_start() != 0)
            _report_link_state(KeyboardLinkDisconnected);
    }
}

static void _on_timeout(uint8_t src) {
    if (src == BLE_GAP_TIMEOUT_SRC_SCAN) {
        HID_LOG(APP_LOG_LEVEL_INFO, "pairing scan timed out after %d reports, no keyboard found", _scan_reports_seen);
    } else if (src == BLE_GAP_TIMEOUT_SRC_CONN) {
        HID_LOG(APP_LOG_LEVEL_INFO, "connect timed out (%s)", _hid_connect_is_pairing ? "pairing" : "reconnect");
    } else {
        HID_LOG(APP_LOG_LEVEL_INFO, "timeout source %d", src);
        return;
    }
    _set_state(HID_IDLE);
    _hid_connect_is_pairing = 0;
    _report_link_state(KeyboardLinkDisconnected);
    _reconnect_start();
}

/***** Background reconnect *****/

/* Issue a pending connect to the bonded keyboard.  Runs from the event
 * handler (after a disconnect), the service thread (after the bond loads,
 * or delayed after a failure) and app threads (hw_keyboard_connect). */
static void _reconnect_start(void) {
    const ble_gap_addr_t *target;
    ret_code_t rv;

    if (!_bond.valid || _hid_conn != BLE_CONN_HANDLE_INVALID || _hid_state != HID_IDLE)
        return;

    if (_hid_reconnect_backoff) {
        _hid_reconnect_backoff = 0;
        HID_LOG(APP_LOG_LEVEL_INFO, "last link failed; reconnecting in %d ms", HID_FAIL_BACKOFF_MS);
        service_submit(_svc_reconnect, (void *)(intptr_t)_hid_link_gen, pdMS_TO_TICKS(HID_FAIL_BACKOFF_MS));
        return;
    }

    target = &_bond.addr;
    if (_bond_id_usable() && !_addr_eq(&_bond.addr, &_bond.peer_id.id_addr_info)) {
        /* The keyboard connected with a resolvable private address and
         * distributed its IRK and identity address.  S140
         * (sd_ble_gap_device_identities_set, ble_gap_addr_t::addr_id_peer):
         * with the peer's IRK in the device identity list the SoftDevice
         * resolves the private addresses it hears, and sd_ble_gap_connect
         * takes the peer *identity* address; without the list entry a
         * connect to the identity address is rejected with
         * NRF_ERROR_INVALID_PARAM.  We rely on the list not being "in use"
         * by our advertiser: privacy is off and it uses no whitelist. */
        _id_list[0] = &_bond.peer_id;
        rv = sd_ble_gap_device_identities_set(_id_list, NULL, 1);
        if (rv == NRF_SUCCESS) {
            target = &_bond.peer_id.id_addr_info;
        } else {
            HID_LOG(APP_LOG_LEVEL_ERROR, "sd_ble_gap_device_identities_set failed (%d); using the last connection address", rv);
        }
    }

    rv = _connect_to(target, &_scan_params_reconnect, 0);
    if (rv == NRF_ERROR_INVALID_STATE) {
        /* An initiator is already pending (for example a connect issued
         * from another context a moment ago); nothing to do. */
        _set_state(HID_CONNECTING);
    }
}

/***** Security *****/

static void _start_authenticate(void) {
    memset(&_keys_own_enc, 0, sizeof(_keys_own_enc));
    memset(&_keys_peer_enc, 0, sizeof(_keys_peer_enc));
    memset(&_keys_own_id, 0, sizeof(_keys_own_id));
    memset(&_keys_peer_id, 0, sizeof(_keys_peer_id));
    _hid_pairing_requested = 1;
    _hid_auth_done = 0;
    /* S140: in the central role sd_ble_gap_authenticate sends the SMP
     * Pairing Request; BLE_GAP_EVT_SEC_PARAMS_REQUEST then asks for the key
     * storage. */
    ret_code_t rv = sd_ble_gap_authenticate(_hid_conn, &_hid_sec_params);
    HID_LOG(APP_LOG_LEVEL_INFO, "pairing (Just Works): sd_ble_gap_authenticate -> %d", rv);
    if (rv == NRF_ERROR_BUSY)
        _defer_retry(RETRY_AUTHENTICATE);
    else if (rv != NRF_SUCCESS)
        _fail("sd_ble_gap_authenticate failed");
}

static void _start_encrypt(void) {
    /* S140: sd_ble_gap_encrypt takes the master id and encryption info the
     * peripheral distributed when we bonded (keys_peer.p_enc_key). */
    ret_code_t rv = sd_ble_gap_encrypt(_hid_conn, &_bond.peer_enc.master_id, &_bond.peer_enc.enc_info);
    HID_LOG(APP_LOG_LEVEL_INFO, "encrypting with the stored bond: sd_ble_gap_encrypt -> %d", rv);
    if (rv == NRF_SUCCESS)
        return;
    if (rv == NRF_ERROR_BUSY) {
        _defer_retry(RETRY_ENCRYPT);
        return;
    }
    HID_LOG(APP_LOG_LEVEL_ERROR, "sd_ble_gap_encrypt failed (%d); pairing instead", rv);
    _hid_encrypt_fallback_used = 1;
    _start_authenticate();
}

static void _maybe_start_discovery(void) {
    if (_hid_state != HID_PAIRING || !_hid_encrypted)
        return;
    /* When we paired on this link, wait for BLE_GAP_EVT_AUTH_STATUS so the
     * SMP key distribution is over before ATT traffic starts. */
    if (_hid_pairing_requested && !_hid_auth_done)
        return;
    _set_state(HID_DISCOVERING);
    _disc_phase = DISC_SERVICE;
    _n_inputs = 0;
    _n_report_chars = 0;
    _last_input = NULL;
    _proto_mode_hnd = BLE_GATT_HANDLE_INVALID;
    _disc_step();
}

static void _on_sec_params_request(const ble_gap_evt_sec_params_request_t *req) {
    HID_LOG(APP_LOG_LEVEL_INFO, "peer sec params: bond %d mitm %d lesc %d io_caps %d keys %d..%d",
            req->peer_params.bond, req->peer_params.mitm, req->peer_params.lesc, req->peer_params.io_caps,
            req->peer_params.min_key_size, req->peer_params.max_key_size);
    /* S140: in the central role p_sec_params must be NULL here (they were
     * given to sd_ble_gap_authenticate); the keyset supplies the memory the
     * SoftDevice fills with the exchanged keys. */
    ret_code_t rv = sd_ble_gap_sec_params_reply(_hid_conn, BLE_GAP_SEC_STATUS_SUCCESS, NULL, &_hid_keyset);
    if (rv == NRF_SUCCESS)
        return;
    if (rv == NRF_ERROR_BUSY) {
        /* S140: the request stays pending and the reply may be repeated. */
        _defer_retry(RETRY_SEC_PARAMS_REPLY);
        return;
    }
    HID_LOG(APP_LOG_LEVEL_ERROR, "sd_ble_gap_sec_params_reply failed (%d)", rv);
    _fail("could not reply to the security parameters request");
}

static void _on_auth_status(const ble_gap_evt_auth_status_t *as) {
    HID_LOG(APP_LOG_LEVEL_INFO, "auth status 0x%02x src %d bonded %d lesc %d kdist own enc %d id %d peer enc %d id %d",
            as->auth_status, as->error_src, as->bonded, as->lesc,
            as->kdist_own.enc, as->kdist_own.id, as->kdist_peer.enc, as->kdist_peer.id);
    if (as->auth_status != BLE_GAP_SEC_STATUS_SUCCESS) {
        _fail("pairing failed");
        return;
    }
    _hid_auth_done = 1;
    if (as->bonded) {
        if (!as->kdist_peer.enc)
            HID_LOG(APP_LOG_LEVEL_WARNING, "keyboard did not distribute its LTK; reconnects will need to pair again");
        /* The record is only ever written here (event context) and read by
         * the service thread under a critical section that masks us. */
        _bond.valid = 1;
        _bond.addr = _hid_peer_addr;
        _bond.peer_enc = _keys_peer_enc;
        if (as->kdist_peer.id)
            _bond.peer_id = _keys_peer_id;
        else
            memset(&_bond.peer_id, 0, sizeof(_bond.peer_id));
        _bond.own_enc = _keys_own_enc;
        strncpy(_bond.name, _hid_name[0] ? _hid_name : "Keyboard", sizeof(_bond.name) - 1);
        _bond.name[sizeof(_bond.name) - 1] = 0;
        HID_LOG(APP_LOG_LEVEL_INFO, "bonded with \"%s\" at %s: peer ediv %04x, ltk len %d",
                _bond.name, _addr_str(&_bond.addr), _bond.peer_enc.master_id.ediv,
                _bond.peer_enc.enc_info.ltk_len);
        if (_bond_id_usable())
            HID_LOG(APP_LOG_LEVEL_INFO, "keyboard identity address %s", _addr_str(&_bond.peer_id.id_addr_info));
        service_submit(_svc_bond_store, NULL, 0);
    }
    _maybe_start_discovery();
}

static void _on_conn_sec_update(const ble_gap_evt_conn_sec_update_t *cs) {
    HID_LOG(APP_LOG_LEVEL_INFO, "conn sec update: mode %d level %d key size %d",
            cs->conn_sec.sec_mode.sm, cs->conn_sec.sec_mode.lv, cs->conn_sec.encr_key_size);
    if (cs->conn_sec.sec_mode.lv >= 2) {
        _hid_encrypted = 1;
        _maybe_start_discovery();
        return;
    }
    if (_hid_state != HID_PAIRING)
        return;  /* a security change on a link that is already past pairing; nothing to decide */
    /* Level 1 after our sd_ble_gap_encrypt means the keyboard rejected the
     * stored key (the Peer Manager reports this event pattern as
     * PIN_OR_KEY_MISSING).  Pair once more, then give up. */
    if (!_hid_pairing_requested && !_hid_encrypt_fallback_used) {
        HID_LOG(APP_LOG_LEVEL_WARNING, "keyboard rejected the stored key; pairing again");
        _hid_encrypt_fallback_used = 1;
        _start_authenticate();
        return;
    }
    _fail("link is not encrypted");
}

static void _on_sec_request(const ble_gap_evt_sec_request_t *sr) {
    HID_LOG(APP_LOG_LEVEL_INFO, "security request: bond %d mitm %d lesc %d", sr->bond, sr->mitm, sr->lesc);
    if (_hid_encrypted)
        return;  /* already secure; the SoftDevice rejects a second procedure anyway */
    if (_hid_pairing_requested)
        return;  /* our pairing is in flight; the request is satisfied by it */
    if (_peer_matches_bond(&_hid_peer_addr))
        _start_encrypt();
    else
        _start_authenticate();
}

/***** GATT discovery *****/

static struct hid_input *_input_add(uint8_t kind, const ble_gattc_char_t *c) {
    if (_n_inputs >= HID_MAX_INPUTS)
        return NULL;
    struct hid_input *in = &_inputs[_n_inputs++];
    memset(in, 0, sizeof(*in));
    in->kind = kind;
    in->notify = c->char_props.notify;
    in->decl = c->handle_decl;
    in->value = c->handle_value;
    in->desc_end = 0;
    in->cccd = BLE_GATT_HANDLE_INVALID;
    in->ref = BLE_GATT_HANDLE_INVALID;
    return in;
}

/* Choose what to subscribe to once descriptors and report references are known. */
static void _disc_choose(void) {
    struct hid_input *boot = NULL;
    int n_sub = 0;

    for (int i = 0; i < _n_inputs; i++) {
        struct hid_input *in = &_inputs[i];
        HID_LOG(APP_LOG_LEVEL_INFO, "input %d: %s value %04x cccd %04x ref %04x id %d type %d notify %d",
                i, in->kind == INPUT_BOOT_KEYBOARD ? "boot kbd" : "report", in->value, in->cccd, in->ref,
                in->report_id, in->report_type, in->notify);
        if (in->kind == INPUT_BOOT_KEYBOARD && in->notify && in->cccd != BLE_GATT_HANDLE_INVALID)
            boot = in;
    }

    if (boot && _proto_mode_hnd != BLE_GATT_HANDLE_INVALID) {
        HID_LOG(APP_LOG_LEVEL_INFO, "using boot protocol (protocol mode %04x, boot input %04x)", _proto_mode_hnd, boot->value);
        _use_boot = 1;
        _disc_idx = boot - _inputs;
        _disc_phase = DISC_PROTO;
        return;
    }

    for (int i = 0; i < _n_inputs; i++) {
        struct hid_input *in = &_inputs[i];
        if (in->kind == INPUT_REPORT && in->notify && in->cccd != BLE_GATT_HANDLE_INVALID &&
            in->report_type == HID_REPORT_TYPE_INPUT)
            n_sub++;
    }
    if (n_sub == 0) {
        _fail("no usable input report (no boot keyboard input with protocol mode, no input Report characteristic)");
        return;
    }
    HID_LOG(APP_LOG_LEVEL_INFO, "using report protocol: %d input report(s)", n_sub);
    _use_boot = 0;
    _disc_idx = 0;
    _disc_phase = DISC_CCCD;
}

