rattrayalex/RebbleOS/hw/drivers/nrf52_bluetooth/nrf52_bluetooth_hid.c
static int _input_wants_cccd(const struct hid_input *in) {
    if (in->cccd == BLE_GATT_HANDLE_INVALID || !in->notify)
        return 0;
    if (_use_boot)
        return in->kind == INPUT_BOOT_KEYBOARD;
    return in->kind == INPUT_REPORT && in->report_type == HID_REPORT_TYPE_INPUT;
}

static void _disc_ready(void) {
    _disc_phase = DISC_DONE;
    _hid_reconnect_backoff = 0;
    _set_state(HID_READY);
    HID_LOG(APP_LOG_LEVEL_INFO, "keyboard \"%s\" ready", _hid_name[0] ? _hid_name : "(unnamed)");
    _report_link_state(KeyboardLinkConnected);
}

/* Issue the SoftDevice call for the current discovery phase.  One GATT
 * client procedure is outstanding at a time; every response event calls
 * back here for the next one.  State that describes the outstanding call is
 * set before the call, so a response that arrives (in event context) before
 * a thread-context caller returns sees the right phase.  Re-entrant: a busy
 * SoftDevice is retried from the service thread HID_RETRY_MS later. */
static void _disc_step(void) {
    ret_code_t rv = NRF_SUCCESS;
    static const uint8_t cccd_notify[2] = { BLE_GATT_HVX_NOTIFICATION, 0x00 };
    static const uint8_t protocol_mode_boot = HID_PROTOCOL_MODE_BOOT;

    if (_hid_conn == BLE_CONN_HANDLE_INVALID)
        return;

    switch (_disc_phase) {
    case DISC_SERVICE: {
        ble_uuid_t uuid = { .uuid = BLE_UUID_HUMAN_INTERFACE_DEVICE_SERVICE, .type = BLE_UUID_TYPE_BLE };
        rv = sd_ble_gattc_primary_services_discover(_hid_conn, BLE_GATT_HANDLE_START, &uuid);
        break;
    }
    case DISC_CHARS: {
        ble_gattc_handle_range_t range = { .start_handle = _char_next, .end_handle = _svc_range.end_handle };
        rv = sd_ble_gattc_characteristics_discover(_hid_conn, &range);
        break;
    }
    case DISC_DESCS: {
        struct hid_input *in = NULL;
        /* Advance to an input with descriptor handles still to search. */
        while (_disc_idx < _n_inputs) {
            in = &_inputs[_disc_idx];
            if (_desc_next == 0)
                _desc_next = in->value + 1;
            if (_desc_next <= in->desc_end)
                break;
            _disc_idx++;
            _desc_next = 0;
            in = NULL;
        }
        if (!in) {
            _disc_phase = DISC_REFS;
            _disc_idx = 0;
            _disc_step();
            return;
        }
        ble_gattc_handle_range_t range = { .start_handle = _desc_next, .end_handle = in->desc_end };
        rv = sd_ble_gattc_descriptors_discover(_hid_conn, &range);
        break;
    }
    case DISC_REFS: {
        while (_disc_idx < _n_inputs &&
               (_inputs[_disc_idx].kind != INPUT_REPORT || _inputs[_disc_idx].ref == BLE_GATT_HANDLE_INVALID))
            _disc_idx++;
        if (_disc_idx >= _n_inputs) {
            _disc_choose();
            if (_disc_phase == DISC_PROTO || _disc_phase == DISC_CCCD)
                _disc_step();
            return;
        }
        rv = sd_ble_gattc_read(_hid_conn, _inputs[_disc_idx].ref, 0);
        break;
    }
    case DISC_PROTO: {
        /* HOGP boot host: Protocol Mode is written with a Write Command; the
         * only completion event is BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE, which
         * we wait for so the CCCD write request follows it on air. */
        ble_gattc_write_params_t w = {
            .write_op = BLE_GATT_OP_WRITE_CMD,
            .flags = 0,
            .handle = _proto_mode_hnd,
            .offset = 0,
            .len = sizeof(protocol_mode_boot),
            .p_value = &protocol_mode_boot,
        };
        _disc_phase = DISC_PROTO_WAIT;
        _set_state(HID_SUBSCRIBING);
        rv = sd_ble_gattc_write(_hid_conn, &w);
        if (rv != NRF_SUCCESS)
            _disc_phase = DISC_PROTO;
        break;
    }
    case DISC_PROTO_WAIT:
        return;  /* waiting for the write command to leave the radio */
    case DISC_CCCD: {
        while (_disc_idx < _n_inputs && !_input_wants_cccd(&_inputs[_disc_idx]))
            _disc_idx++;
        if (_disc_idx >= _n_inputs) {
            _disc_ready();
            return;
        }
        ble_gattc_write_params_t w = {
            .write_op = BLE_GATT_OP_WRITE_REQ,
            .flags = 0,
            .handle = _inputs[_disc_idx].cccd,
            .offset = 0,
            .len = sizeof(cccd_notify),
            .p_value = cccd_notify,
        };
        _set_state(HID_SUBSCRIBING);
        rv = sd_ble_gattc_write(_hid_conn, &w);
        break;
    }
    case DISC_NONE:
    case DISC_DONE:
    default:
        return;
    }

    if (rv == NRF_SUCCESS)
        return;
    if (rv == NRF_ERROR_BUSY || rv == NRF_ERROR_RESOURCES) {
        HID_LOG(APP_LOG_LEVEL_INFO, "discovery phase %d: SoftDevice busy (%d), retrying in %d ms", _disc_phase, rv, HID_RETRY_MS);
        _defer_retry(RETRY_DISCOVERY);
        return;
    }
    HID_LOG(APP_LOG_LEVEL_ERROR, "discovery phase %d: SoftDevice call failed (%d)", _disc_phase, rv);
    _fail("GATT discovery call failed");
}

static void _on_prim_srvc_disc_rsp(const ble_gattc_evt_t *ev) {
    if (_disc_phase != DISC_SERVICE)
        return;
    const ble_gattc_evt_prim_srvc_disc_rsp_t *rsp = &ev->params.prim_srvc_disc_rsp;
    if (ev->gatt_status != BLE_GATT_STATUS_SUCCESS || rsp->count == 0) {
        HID_LOG(APP_LOG_LEVEL_ERROR, "no HID service (gatt status 0x%04x, count %d)", ev->gatt_status,
                ev->gatt_status == BLE_GATT_STATUS_SUCCESS ? rsp->count : 0);
        _fail("keyboard has no HID service");
        return;
    }
    _svc_range = rsp->services[0].handle_range;
    HID_LOG(APP_LOG_LEVEL_INFO, "HID service handles %04x..%04x", _svc_range.start_handle, _svc_range.end_handle);
    _char_next = _svc_range.start_handle;
    _disc_phase = DISC_CHARS;
    _disc_step();
}

static void _on_char_disc_rsp(const ble_gattc_evt_t *ev) {
    if (_disc_phase != DISC_CHARS)
        return;
    const ble_gattc_evt_char_disc_rsp_t *rsp = &ev->params.char_disc_rsp;
    int done = 0;

    if (ev->gatt_status == BLE_GATT_STATUS_SUCCESS) {
        uint16_t last_value = 0;
        for (int i = 0; i < rsp->count; i++) {
            const ble_gattc_char_t *c = &rsp->chars[i];
            /* The previous input's descriptors end just before this declaration. */
            if (_last_input && _last_input->desc_end == 0)
                _last_input->desc_end = c->handle_decl - 1;
            _last_input = NULL;
            last_value = c->handle_value;

            uint16_t uuid = (c->uuid.type == BLE_UUID_TYPE_BLE) ? c->uuid.uuid : 0;
            HID_LOG(APP_LOG_LEVEL_INFO, "char uuid %04x (type %d) decl %04x value %04x props r%d w%d wnr%d n%d",
                    uuid, c->uuid.type, c->handle_decl, c->handle_value,
                    c->char_props.read, c->char_props.write, c->char_props.write_wo_resp, c->char_props.notify);
            switch (uuid) {
            case BLE_UUID_PROTOCOL_MODE_CHAR:
                _proto_mode_hnd = c->handle_value;
                break;
            case BLE_UUID_BOOT_KEYBOARD_INPUT_REPORT_CHAR:
                if (c->char_props.notify)
                    _last_input = _input_add(INPUT_BOOT_KEYBOARD, c);
                break;
            case BLE_UUID_REPORT_CHAR:
                if (c->char_props.notify && _n_report_chars < HID_MAX_REPORT_CHARS) {
                    _last_input = _input_add(INPUT_REPORT, c);
                    if (_last_input)
                        _n_report_chars++;
                }
                break;
            default:
                break;
            }
        }
        if (rsp->count == 0 || last_value >= _svc_range.end_handle)
            done = 1;
        else
            _char_next = last_value + 1;
    } else if (ev->gatt_status == BLE_GATT_STATUS_ATTERR_ATTRIBUTE_NOT_FOUND) {
        done = 1;
    } else {
        HID_LOG(APP_LOG_LEVEL_ERROR, "characteristic discovery failed, gatt status 0x%04x", ev->gatt_status);
        _fail("characteristic discovery failed");
        return;
    }

    if (!done) {
        _disc_step();
        return;
    }
    if (_last_input && _last_input->desc_end == 0)
        _last_input->desc_end = _svc_range.end_handle;
    _last_input = NULL;
    HID_LOG(APP_LOG_LEVEL_INFO, "%d input characteristic(s), protocol mode %04x", _n_inputs, _proto_mode_hnd);
    if (_n_inputs == 0) {
        _fail("HID service has no notifying input characteristic");
        return;
    }
    _disc_phase = DISC_DESCS;
    _disc_idx = 0;
    _desc_next = 0;
    _disc_step();
}

static void _on_desc_disc_rsp(const ble_gattc_evt_t *ev) {
    if (_disc_phase != DISC_DESCS || _disc_idx >= _n_inputs)
        return;
    struct hid_input *in = &_inputs[_disc_idx];
    const ble_gattc_evt_desc_disc_rsp_t *rsp = &ev->params.desc_disc_rsp;

    if (ev->gatt_status == BLE_GATT_STATUS_SUCCESS && rsp->count > 0) {
        uint16_t last = _desc_next;
        for (int i = 0; i < rsp->count; i++) {
            const ble_gattc_desc_t *d = &rsp->descs[i];
            last = d->handle;
            if (d->uuid.type != BLE_UUID_TYPE_BLE)
                continue;
            if (d->uuid.uuid == BLE_UUID_DESCRIPTOR_CLIENT_CHAR_CONFIG)
                in->cccd = d->handle;
            else if (d->uuid.uuid == BLE_UUID_REPORT_REF_DESCR)
                in->ref = d->handle;
        }
        _desc_next = last + 1;
    } else {
        /* Attribute-not-found (or any error) ends this characteristic's range. */
        if (ev->gatt_status != BLE_GATT_STATUS_SUCCESS && ev->gatt_status != BLE_GATT_STATUS_ATTERR_ATTRIBUTE_NOT_FOUND)
            HID_LOG(APP_LOG_LEVEL_WARNING, "descriptor discovery for value %04x: gatt status 0x%04x", in->value, ev->gatt_status);
        _desc_next = in->desc_end + 1;
    }
    _disc_step();
}

static void _on_read_rsp(const ble_gattc_evt_t *ev) {
    if (_disc_phase != DISC_REFS || _disc_idx >= _n_inputs)
        return;
    struct hid_input *in = &_inputs[_disc_idx];
    const ble_gattc_evt_read_rsp_t *rsp = &ev->params.read_rsp;

    if (ev->gatt_status == BLE_GATT_STATUS_SUCCESS && rsp->handle == in->ref && rsp->len >= 2) {
        in->report_id = rsp->data[0];
        in->report_type = rsp->data[1];
    } else {
        HID_LOG(APP_LOG_LEVEL_WARNING, "report reference %04x read: gatt status 0x%04x len %d", in->ref, ev->gatt_status,
                ev->gatt_status == BLE_GATT_STATUS_SUCCESS ? rsp->len : 0);
        in->report_type = 0;
    }
    _disc_idx++;
    _disc_step();
}

static void _on_write_rsp(const ble_gattc_evt_t *ev) {
    if (_disc_phase != DISC_CCCD || _disc_idx >= _n_inputs)
        return;
    struct hid_input *in = &_inputs[_disc_idx];
    const ble_gattc_evt_write_rsp_t *rsp = &ev->params.write_rsp;

