rattrayalex/RebbleOS/hw/drivers/nrf52_bluetooth/nrf52_bluetooth_hid.c
    if (ev->gatt_status != BLE_GATT_STATUS_SUCCESS) {
        HID_LOG(APP_LOG_LEVEL_ERROR, "CCCD %04x write rejected, gatt status 0x%04x", in->cccd, ev->gatt_status);
        _fail("keyboard rejected the notification subscription");
        return;
    }
    if (rsp->handle != in->cccd)
        HID_LOG(APP_LOG_LEVEL_WARNING, "write response for %04x, expected CCCD %04x", rsp->handle, in->cccd);
    in->subscribed = 1;
    HID_LOG(APP_LOG_LEVEL_INFO, "subscribed to %s value %04x (report id %d)",
            in->kind == INPUT_BOOT_KEYBOARD ? "boot keyboard input" : "input report", in->value, in->report_id);
    _disc_idx++;
    _disc_step();
}

static void _on_hvx(const ble_gattc_evt_t *ev) {
    const ble_gattc_evt_hvx_t *hvx = &ev->params.hvx;

    if (hvx->type == BLE_GATT_HVX_INDICATION) {
        /* HID uses notifications; confirm a stray indication so the peer
         * does not stall, then ignore it. */
        (void) sd_ble_gattc_hv_confirm(_hid_conn, hvx->handle);
        return;
    }
    for (int i = 0; i < _n_inputs; i++) {
        if (_inputs[i].subscribed && _inputs[i].value == hvx->handle) {
            _ring_push(hvx->data, hvx->len);
            return;
        }
    }
    HID_LOG(APP_LOG_LEVEL_INFO, "notification from unsubscribed handle %04x (%d bytes)", hvx->handle, hvx->len);
}

/***** Connection events *****/

static void _on_connected(const ble_gap_evt_t *gap) {
    const ble_gap_evt_connected_t *c = &gap->params.connected;

    if (_hid_conn != BLE_CONN_HANDLE_INVALID) {
        /* Cannot happen with one central link configured; keep the first. */
        HID_LOG(APP_LOG_LEVEL_ERROR, "second central link %d while %d is up; dropping it", gap->conn_handle, _hid_conn);
        (void) sd_ble_gap_disconnect(gap->conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        return;
    }
    if (_hid_state == HID_SCANNING) {
        /* A background reconnect completed just as hw_keyboard_pair_start()
         * cancelled it; the user wants a new keyboard, so drop this link
         * and keep scanning.  This also happens if the bonded keyboard
         * itself wakes up mid-scan. */
        HID_LOG(APP_LOG_LEVEL_INFO, "connection from %s during a pairing scan; dropping it", _addr_str(&c->peer_addr));
        (void) sd_ble_gap_disconnect(gap->conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        return;
    }

    int pairing = _hid_connect_is_pairing;
    _link_reset();
    _hid_conn = gap->conn_handle;
    _hid_link_gen++;
    _hid_peer_addr = c->peer_addr;
    _hid_connect_is_pairing = pairing;

    int bonded = _peer_matches_bond(&c->peer_addr);
    if (bonded && !_hid_name[0])
        strncpy(_hid_name, _bond.name, sizeof(_hid_name) - 1);

    HID_LOG(APP_LOG_LEVEL_INFO, "connected (handle %d) to %s%s, interval %d x 1.25 ms, %s",
            _hid_conn, _addr_str(&c->peer_addr), c->peer_addr.addr_id_peer ? " (resolved)" : "",
            c->conn_params.max_conn_interval, bonded ? "matches the stored bond" : "no bond");

    _set_state(HID_PAIRING);
    if (!pairing)
        _report_link_state(KeyboardLinkConnecting);
    service_submit(_svc_watchdog, (void *)(intptr_t)_hid_link_gen, pdMS_TO_TICKS(HID_WATCHDOG_MS));

    if (bonded)
        _start_encrypt();
    else
        _start_authenticate();
}

static void _on_disconnected(const ble_gap_evt_t *gap) {
    HID_LOG(APP_LOG_LEVEL_INFO, "disconnected, HCI reason 0x%02x (state %s)", gap->params.disconnected.reason,
            _state_names[_hid_state]);
    _link_reset();
    _hid_link_gen++;   /* orphan the watchdog and any pending retry */
    _set_state(HID_IDLE);

    if (_hid_pair_after_disconnect) {
        _hid_pair_after_disconnect = 0;
        if (_scan_start() == 0)
            return;
    }
    _report_link_state(KeyboardLinkDisconnected);
    if (_hid_forgetting) {
        _hid_forgetting = 0;
        return;
    }
    _reconnect_start();
}

/***** SoftDevice event observer *****/

static void _hid_handler(const ble_evt_t *evt, void *context) {
    uint16_t id = evt->header.evt_id;
    /* conn_handle is the first member of every module's event struct. */
    uint16_t conn = evt->evt.common_evt.conn_handle;
    ret_code_t rv;

    switch (id) {
    case BLE_GAP_EVT_CONNECTED:
        /* The phone's peripheral link belongs to nrf52_bluetooth.c. */
        if (evt->evt.gap_evt.params.connected.role != BLE_GAP_ROLE_CENTRAL)
            return;
        _on_connected(&evt->evt.gap_evt);
        return;
    case BLE_GAP_EVT_ADV_REPORT:
        _on_adv_report(&evt->evt.gap_evt.params.adv_report);
        return;
    case BLE_GAP_EVT_TIMEOUT: {
        uint8_t src = evt->evt.gap_evt.params.timeout.src;
        /* Scan and connect timeouts carry no connection; only we scan or initiate. */
        if (src == BLE_GAP_TIMEOUT_SRC_SCAN || src == BLE_GAP_TIMEOUT_SRC_CONN) {
            HID_LOG(APP_LOG_LEVEL_INFO, "evt TIMEOUT src %d", src);
            _on_timeout(src);
            return;
        }
        break;
    }
    default:
        break;
    }

    if (_hid_conn == BLE_CONN_HANDLE_INVALID || conn != _hid_conn)
        return;

    /* Every event for the keyboard link is logged, so a tester's first log
     * shows where a sequence stops.  Notifications drop to DEBUG after the
     * first few, since every key press produces two of them. */
    if (id == BLE_GATTC_EVT_HVX && _hid_hvx_logged >= 8)
        DRV_LOG("bt", APP_LOG_LEVEL_DEBUG, "HID: evt 0x%04x HVX", id);
    else
        HID_LOG(APP_LOG_LEVEL_INFO, "evt 0x%04x %s", id, _evt_name(id));

    switch (id) {
    case BLE_GAP_EVT_DISCONNECTED:
        _on_disconnected(&evt->evt.gap_evt);
        break;
    case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
        _on_sec_params_request(&evt->evt.gap_evt.params.sec_params_request);
        break;
    case BLE_GAP_EVT_AUTH_STATUS:
        _on_auth_status(&evt->evt.gap_evt.params.auth_status);
        break;
    case BLE_GAP_EVT_CONN_SEC_UPDATE:
        _on_conn_sec_update(&evt->evt.gap_evt.params.conn_sec_update);
        break;
    case BLE_GAP_EVT_SEC_REQUEST:
        _on_sec_request(&evt->evt.gap_evt.params.sec_request);
        break;
    case BLE_GAP_EVT_PASSKEY_DISPLAY:
    case BLE_GAP_EVT_AUTH_KEY_REQUEST:
        /* Just Works only: no passkey to show or enter.  Reject so the
         * procedure ends with an AUTH_STATUS failure instead of hanging. */
        HID_LOG(APP_LOG_LEVEL_ERROR, "keyboard wants a passkey; only Just Works pairing is supported");
        (void) sd_ble_gap_auth_key_reply(_hid_conn, BLE_GAP_AUTH_KEY_TYPE_NONE, NULL);
        break;
    case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST: {
        /* S140: as the central we accept by running the update with the
         * requested parameters (NULL would reject). */
        const ble_gap_conn_params_t *cp = &evt->evt.gap_evt.params.conn_param_update_request.conn_params;
        HID_LOG(APP_LOG_LEVEL_INFO, "conn param request: interval %d..%d latency %d timeout %d",
                cp->min_conn_interval, cp->max_conn_interval, cp->slave_latency, cp->conn_sup_timeout);
        rv = sd_ble_gap_conn_param_update(_hid_conn, cp);
        if (rv != NRF_SUCCESS) {
            HID_LOG(APP_LOG_LEVEL_WARNING, "sd_ble_gap_conn_param_update(accept) failed (%d); rejecting", rv);
            (void) sd_ble_gap_conn_param_update(_hid_conn, NULL);
        }
        break;
    }
    case BLE_GAP_EVT_CONN_PARAM_UPDATE: {
        const ble_gap_conn_params_t *cp = &evt->evt.gap_evt.params.conn_param_update.conn_params;
        HID_LOG(APP_LOG_LEVEL_INFO, "conn params now interval %d latency %d timeout %d",
                cp->max_conn_interval, cp->slave_latency, cp->conn_sup_timeout);
        break;
    }
    case BLE_GAP_EVT_PHY_UPDATE_REQUEST: {
        const ble_gap_phys_t phys = { .rx_phys = BLE_GAP_PHY_AUTO, .tx_phys = BLE_GAP_PHY_AUTO };
        rv = sd_ble_gap_phy_update(_hid_conn, &phys);
        if (rv != NRF_SUCCESS)
            HID_LOG(APP_LOG_LEVEL_WARNING, "sd_ble_gap_phy_update failed (%d)", rv);
        break;
    }
    case BLE_GAP_EVT_PHY_UPDATE:
    case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST:  /* answered by nrf_ble_gatt for every link */
    case BLE_GAP_EVT_DATA_LENGTH_UPDATE:
    case BLE_GAP_EVT_TIMEOUT:                     /* authenticated payload timeout; the link drops on its own */
    case BLE_GAP_EVT_SEC_INFO_REQUEST:            /* peripheral role only */
    case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST:      /* answered by nrf_ble_gatt */
        break;
    case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP:
        _on_prim_srvc_disc_rsp(&evt->evt.gattc_evt);
        break;
    case BLE_GATTC_EVT_CHAR_DISC_RSP:
        _on_char_disc_rsp(&evt->evt.gattc_evt);
        break;
    case BLE_GATTC_EVT_DESC_DISC_RSP:
        _on_desc_disc_rsp(&evt->evt.gattc_evt);
        break;
    case BLE_GATTC_EVT_READ_RSP:
        _on_read_rsp(&evt->evt.gattc_evt);
        break;
    case BLE_GATTC_EVT_WRITE_RSP:
        _on_write_rsp(&evt->evt.gattc_evt);
        break;
    case BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE:
        if (_disc_phase == DISC_PROTO_WAIT) {
            _disc_phase = DISC_CCCD;
            _disc_step();
        }
        break;
    case BLE_GATTC_EVT_HVX:
        _hid_hvx_logged++;
        _on_hvx(&evt->evt.gattc_evt);
        break;
    case BLE_GATTC_EVT_TIMEOUT:
        /* S140: after an ATT timeout no GATT procedure can run on this link. */
        _fail("GATT procedure timed out");
        break;
    default:
        break;
    }
}

/***** Core -> driver requests (strong definitions; rcore/keyboard.c has weak defaults) *****/

bool hw_keyboard_is_supported(void) {
    return true;
}

bool hw_keyboard_has_bond(void) {
    return _bond.valid != 0;
}

/* Called from app threads.  sd_* calls are fine here; the state checks are
 * done under a critical section and the resulting transitions arrive as
 * SoftDevice events.  A pairing scan already running returns -1. */
int hw_keyboard_pair_start(void) {
    uint16_t conn;
    enum hid_state st;

