rattrayalex/RebbleOS/hw/drivers/nrf52_bluetooth/nrf52_bluetooth_hid.c
    taskENTER_CRITICAL();
    st = _hid_state;
    conn = _hid_conn;
    if (st != HID_SCANNING) {
        _hid_forgetting = 0;
        _hid_reconnect_backoff = 0;
        _hid_pair_after_disconnect = (conn != BLE_CONN_HANDLE_INVALID);
    }
    taskEXIT_CRITICAL();
    if (st == HID_SCANNING) {
        HID_LOG(APP_LOG_LEVEL_INFO, "pair_start: a pairing scan is already running");
        return -1;
    }

    /* S140: sd_ble_gap_connect_cancel ends a pending initiator and
     * sd_ble_gap_scan_stop a scanner; both return NRF_ERROR_INVALID_STATE
     * when there is nothing to stop, and neither generates an event. */
    (void) sd_ble_gap_connect_cancel();
    (void) sd_ble_gap_scan_stop();
    if (st == HID_CONNECTING)
        _set_state(HID_IDLE);

    if (conn != BLE_CONN_HANDLE_INVALID) {
        /* One central link only: drop the current keyboard, and scan once
         * BLE_GAP_EVT_DISCONNECTED arrives (_hid_pair_after_disconnect). */
        HID_LOG(APP_LOG_LEVEL_INFO, "pair_start: disconnecting the current keyboard first");
        ret_code_t rv = sd_ble_gap_disconnect(conn, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        if (rv != NRF_SUCCESS) {
            HID_LOG(APP_LOG_LEVEL_ERROR, "sd_ble_gap_disconnect failed (%d)", rv);
            _hid_pair_after_disconnect = 0;
            return -1;
        }
        _report_link_state(KeyboardLinkScanning);
        return 0;
    }

    return _scan_start();
}

int hw_keyboard_connect(void) {
    enum hid_state st;
    uint16_t conn;

    if (!_bond.valid) {
        HID_LOG(APP_LOG_LEVEL_INFO, "connect: no bonded keyboard");
        return -1;
    }
    taskENTER_CRITICAL();
    st = _hid_state;
    conn = _hid_conn;
    _hid_forgetting = 0;
    _hid_reconnect_backoff = 0;
    taskEXIT_CRITICAL();
    if (conn != BLE_CONN_HANDLE_INVALID || st == HID_CONNECTING)
        return 0;  /* already connected, or the reconnect initiator is pending */
    if (st == HID_SCANNING) {
        HID_LOG(APP_LOG_LEVEL_INFO, "connect: a pairing scan is running");
        return -1;
    }
    _reconnect_start();
    return (_hid_state == HID_CONNECTING) ? 0 : -1;
}

/* Forget the bonded keyboard.  The bond is invalidated in RAM here and
 * persisted from the service thread: prefs_put blocks on the flash
 * filesystem, and although rcore/bluetooth.c already writes the RDB from an
 * app thread (bluetooth_bond_acknowledge), routing every bond write through
 * the service thread keeps the UI thread off the flash and serialises the
 * writes with the store that pairing triggers. */
int hw_keyboard_forget(void) {
    uint16_t conn;
    enum hid_state st;

    taskENTER_CRITICAL();
    _bond.valid = 0;
    conn = _hid_conn;
    st = _hid_state;
    _hid_forgetting = (conn != BLE_CONN_HANDLE_INVALID);
    _hid_pair_after_disconnect = 0;
    _hid_reconnect_backoff = 0;
    taskEXIT_CRITICAL();

    (void) sd_ble_gap_connect_cancel();
    (void) sd_ble_gap_scan_stop();
    if (st == HID_CONNECTING || st == HID_SCANNING)
        _set_state(HID_IDLE);
    /* Drop the identity list entry; fails harmlessly if a role holds it. */
    (void) sd_ble_gap_device_identities_set(NULL, NULL, 0);

    if (conn != BLE_CONN_HANDLE_INVALID) {
        ret_code_t rv = sd_ble_gap_disconnect(conn, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        if (rv != NRF_SUCCESS)
            HID_LOG(APP_LOG_LEVEL_ERROR, "forget: sd_ble_gap_disconnect failed (%d)", rv);
    } else {
        _report_link_state(KeyboardLinkDisconnected);
    }
    _hid_name[0] = 0;
    service_submit(_svc_bond_store, NULL, 0);
    HID_LOG(APP_LOG_LEVEL_INFO, "bond forgotten");
    return 0;
}

/***** Init *****/

/* Called from hw_bluetooth_init() (BT thread) after the SoftDevice is
 * enabled, the pairing handler is registered and PPoGATT is set up. */
void nrf52_hid_init(void) {
    NRF_SDH_BLE_OBSERVER(hid_observer, 3 /* priority */, _hid_handler, NULL);

    _link_reset();
    _hid_state = HID_IDLE;
    memset(&_bond, 0, sizeof(_bond));

    /* The bond is loaded lazily on the service thread (prefs_get blocks);
     * that callback also starts the background reconnect. */
    service_submit(_svc_bond_load, NULL, 0);
    HID_LOG(APP_LOG_LEVEL_INFO, "keyboard host initialised (%d central link, scan buffer %d bytes)",
            NRF_SDH_BLE_CENTRAL_LINK_COUNT, (int)sizeof(_scan_buf_data));
}
